<template>
  <div class="toggle-item">
    <button type="button" class="btn btn-sm btn-outline-dark" @click="toggle">토글테스트-1</button>
    <div :class="`toggle-cnt ${toggleStates ? 'on' : ''}`">
      텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트
      보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기텍스트 보이기
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";
const toggleStates = ref(false);

const toggle = () => {
  toggleStates.value = !toggleStates.value;
};
</script>

<style lang="scss">
.toggle-item {
  .toggle-cnt {
    transition: all 0.5s; // 전환 효과 추가
    //opacity: 0;
    visibility: hidden;
    min-height: 0; // 내용 높이가 없음을 의미
    overflow: hidden; // 내용이 밖으로 넘치지 않도록 함
    &.on {
      // opacity: 1;
      visibility: visible;
      // height: auto;
      min-height: 200px; // 내용이 있을 때 자동으로 높이 조정
    }
  }
}
</style>
